#### SortCurveLoops Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static IList<IList<CurveLoop>> SortCurveLoops( 	IList<CurveLoop> loops ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function SortCurveLoops ( _ 	loops As IList(Of CurveLoop) _ ) As IList(Of IList(Of CurveLoop)) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<IList<CurveLoop^>^>^ SortCurveLoops( 	IList<CurveLoop^>^ loops ) ``` |

#### Parameters

loops
:   Type:  System.Collections.Generic IList   CurveLoop

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace